Функция РозничнаяЦена(АктуальнаяДата,ЭлементНоменклатуры) экспорт
	Отбор = Новый Структура("Номенклатура", ЭлементНоменклатуры);
	ЗначенияРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции  

Функция ПолучитьВидНоменклатуры(Наименование) экспорт 
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Строка(Наименование));
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции 

Функция ПолучитьПроцент(АктуальнаяДата,ВидНоменклатуры) экспорт 
	Перем Назначение;
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга  тогда
		Назначение = Перечисления.Проценты.РасчетСтоимостиУслуги;	
	ИначеЕсли ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал  тогда
		Назначение = Перечисления.Проценты.РасчетСтоимостиМатериала;	
	Иначе
		Назначение = Перечисления.Проценты.РасчетЗарплаты;	
	КонецЕсли;
	
	Отбор = Новый Структура("Назначение", Назначение);
	Процент = РегистрыСведений.Проценты.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Процент.Процент;
КонецФункции

Функция ПроверитьОстатокНаСкладе(АктуальнаяДата,Материал,Склад) экспорт 
	Отбор = Новый Структура;
	Отбор.Вставить("Материал", Материал);
	Отбор.Вставить("Склад",Склад); 
	Остаток = РегистрыНакопления.ОстаткиМатериалов.Остатки(АктуальнаяДата,Отбор);
	Возврат Остаток.Итог("Количество");
КонецФункции 

