&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	Если Строка(СтрокаТабличнойЧасти.ВидНоменклатуры) = "Материал" тогда
		Остаток = РаботаСоСправочниками.ПроверитьОстатокНаСкладе(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура,Объект.Склад);
		Если Остаток < СтрокаТабличнойЧасти.Количество Тогда
			СтрокаТабличнойЧасти.Количество = 0;
			Сообщить("Материала (" + СтрокаТабличнойЧасти.Номенклатура + ") не хватает. На складе осталось " + Остаток +" шт.");
		КонецЕсли;
	КонецЕсли;
	
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	Процент = РаботаСоСправочниками.ПолучитьПроцент(Объект.Дата,СтрокаТабличнойЧасти.ВидНоменклатуры);
	РаботаСДокументами.РассчитатьСтоимость(СтрокаТабличнойЧасти,Процент);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент) 
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.ВидНоменклатуры = ВидНоменклатуры;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
КонецПроцедуры
