
&НаСервере
Процедура СотрудникПриИзмененииНаСервере(Мастер,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура КАК ВыполненыеРаботы,
	|	ОказаниеУслуги.Дата КАК Дата,
	|	ОказаниеУслуги.Клиент КАК Клиент,
	|	ОказаниеУслугиПереченьНоменклатуры.Стоимость КАК Стоимость
	|ИЗ
	|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуги КАК ОказаниеУслуги
	|		ПО (ОказаниеУслугиПереченьНоменклатуры.Ссылка = ОказаниеУслуги.Ссылка)
	|ГДЕ
	|	ОказаниеУслуги.Мастер = &Мастер
	|	И ОказаниеУслугиПереченьНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И МЕСЯЦ(ОказаниеУслуги.Дата) = МЕСЯЦ(&Дата)";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Мастер",Мастер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Перечисления.ВидыНоменклатуры.Услуга);
	РезультатЗапроса = Запрос.Выполнить();
	ТбИзЗапроса = РезультатЗапроса.Выгрузить();
	Объект.ВыполненыеРаботы.Загрузить(ТбИзЗапроса); 
	Процент = РаботаСоСправочниками.ПолучитьПроцент(Объект.Дата,Перечисления.Проценты.РасчетЗарплаты);
	Объект.Зарплата = ТбИзЗапроса.Итог("Стоимость")*Процент/100;
	КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере(Объект.Сотрудник,Объект.Дата);
КонецПроцедуры
