
&НаСервере
Функция НазначениеПриИзмененииНаСервере(НазначениеПроцента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроцентыСрезПоследних.Процент КАК Процент
	|ИЗ
	|	РегистрСведений.Проценты.СрезПоследних КАК ПроцентыСрезПоследних
	|ГДЕ
	|	ПроцентыСрезПоследних.Назначение = &Назначение";
	Запрос.УстановитьПараметр("Назначение",НазначениеПроцента);
	РезультатЗапроса = Запрос.Выполнить();
	ТбИзЗапроса = РезультатЗапроса.Выгрузить();
	Процент = ТбИзЗапроса.Итог("Процент");
	Возврат Процент;
КонецФункции

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	НазначениеПроцента = Объект.Назначение;
	Объект.ТекущийПроцент = НазначениеПриИзмененииНаСервере(НазначениеПроцента);
КонецПроцедуры
